sergz72/ARM/mspm0g350x/ti/driverlib/dl_rtc_common.h
    return (DL_RTC_COMMON_TIME_STAMP_EVENT_CAPTURE)(capture);
}

/**
 * @brief Clear the time stamp and time stamp event status
 *
 *  The time stamp and the time stamp event status are sticky, and will stay
 *  active until cleared by software.
 *
 * @param[in] rtc_common      Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_RTC_Common_clearTimeStamp(RTC_Regs *rtc_common)
{
    rtc_common->TSCLR = (RTC_TSCLR_KEY_UNLOCK_W | RTC_TSCLR_CLR_CLR);
}

/**
 *  @brief      Enable write protection lock of the CLKCTL, SEC, MIN, HOUR,
 *              DAY, MON, YEAR and LFSSRST registers from accidental updates
 *
 *  When enabled, the CLKCTL, SEC, MIN, HOUR, DAY, MON, YEAR and LFSSRST
 *  registers will have read-only properties.
 *
 *  @param[in]  rtc_common    Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_enableWriteProtect(RTC_Regs *rtc_common)
{
    rtc_common->RTCLOCK = (RTC_RTCLOCK_PROTECT_SET | RTC_RTCLOCK_KEY_UNLOCK_W);
}

/**
 *  @brief      Checks if write protection lock of the CLKCTL, SEC, MIN, HOUR,
 *              DAY, MON, YEAR and LFSSRST registers is enabled
 *
 *  @param[in]  rtc_common    Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return     Returns the enabled status of the write protection lock
 *
 *  @retval     true  Write protection lock is enabled
 *  @retval     false Write protection lock is disabled
 */
__STATIC_INLINE bool DL_RTC_Common_isWriteProtectEnabled(RTC_Regs *rtc_common)
{
    return ((rtc_common->RTCLOCK & RTC_RTCLOCK_PROTECT_MASK) ==
            RTC_RTCLOCK_PROTECT_SET);
}

/**
 *  @brief      Disable write protection lock of the CLKCTL, SEC, MIN, HOUR,
 *              DAY, MON, YEAR and LFSSRST registers
 *
 *  @param[in]  rtc_common    Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_disableWriteProtect(RTC_Regs *rtc_common)
{
    rtc_common->RTCLOCK = (RTC_RTCLOCK_PROTECT_CLR | RTC_RTCLOCK_KEY_UNLOCK_W);
}
#endif

#ifdef __cplusplus
}
#endif

#endif /* __MSPM0_HAS_RTC_A__ || __MSPM0_HAS_RTC_B__ || __MSPM0_HAS_RTC__ */

#endif /* ti_dl_dl_rtc_common__include */
/** @}*/
